In [1]:
import pandas as pd
name = ["Sapna","Prashant","Palash","Shirisha","Usha","Vamsi","Chaitanya","Akshat","Neha","Rohit"]
room_number = [102,109,104,106,103,101,204,306,207,200]
gender = ["Female","Male","Male","Female","Female","Male","Male","Male","Female","Male"]
data = {'Name':name,'Room':room_number,'Gender':gender }
df = pd.DataFrame(data)
df

        Name  Room  Gender
0      Sapna   102  Female
1   Prashant   109    Male
2     Palash   104    Male
3   Shirisha   106  Female
4       Usha   103  Female
5      Vamsi   101    Male
6  Chaitanya   204    Male
7     Akshat   306    Male
8       Neha   207  Female
9      Rohit   200    Male

Accessing third element

In [2]:
df[2:3]

     Name  Room Gender
2  Palash   104   Male


Accessing the fifth element

In [3]:
df[4:5]

   Name  Room  Gender
4  Usha   103  Female

Accessing last six values

In [4]:
df[-6:]

        Name  Room  Gender
4       Usha   103  Female
5      Vamsi   101    Male
6  Chaitanya   204    Male
7     Akshat   306    Male
8       Neha   207  Female
9      Rohit   200    Male